## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_management_group.mg_backend will be created
  + resource "azurerm_management_group" "mg_backend" {
      + display_name               = "mg-backend"
      + id                         = (known after apply)
      + name                       = "mg-backend"
      + parent_management_group_id = "/providers/Microsoft.Management/managementGroups/mg-miszel"
      + subscription_ids           = (known after apply)
      + tenant_scoped_id           = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>